# 级联操作
- pd.concat pd.append
#### pandas使用pd.concat与np.concatenate类似，只是多了一些参数：
- 1.objs
- 2.axis=0
- 3.keys
- 4.join='outer' /'inner':表示的是级联的方式，outer会将所有的项进行级联（忽略匹配和不匹配），而inner只会将匹配的项级联到一起，不匹配的不级联
- 5.ignore_index = False
# 合并操作
- merge与concat的区别在于，merge需要依据某一共同列进行合并
- 使用pd.merge()合并是，会自动根据两者相同列名的那一列，作为key进行合并
- 注意每一列元素的顺序不要求一致

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame,Series

In [2]:
df1 = DataFrame(data=np.random.randint(0,100,size= (5,3)),columns=['A','B','C'])
df2 = DataFrame(data=np.random.randint(0,100,size= (5,3)),columns=['A','D','C'])

In [6]:
df1

    A   B   C
0  19  38   0
1  46  80   1
2  30   9  24
3  38  11  87
4  67  94  36

In [7]:
df2

    A   D   C
0   1  93  91
1  29  94  80
2   2  15   7
3  22  53   1
4  77  91  88

In [5]:
pd.concat((df1,df2),axis=1)

    A   B   C   A   D   C
0  19  38   0   1  93  91
1  46  80   1  29  94  80
2  30   9  24   2  15   7
3  38  11  87  22  53   1
4  67  94  36  77  91  88

### 如果想要保留数据的完整性必须使用outer(外连接)

In [10]:
pd.concat((df1,df2),axis=0,join='outer')

    A     B   C     D
0  19  38.0   0   NaN
1  46  80.0   1   NaN
2  30   9.0  24   NaN
3  38  11.0  87   NaN
4  67  94.0  36   NaN
0   1   NaN  91  93.0
1  29   NaN  80  94.0
2   2   NaN   7  15.0
3  22   NaN   1  53.0
4  77   NaN  88  91.0

### append函数的使用

In [11]:
df1.append(df2)

C:\Users\lingdj\AppData\Local\Temp\ipykernel_6664\3062608662.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1.append(df2)

    A     B   C     D
0  19  38.0   0   NaN
1  46  80.0   1   NaN
2  30   9.0  24   NaN
3  38  11.0  87   NaN
4  67  94.0  36   NaN
0   1   NaN  91  93.0
1  29   NaN  80  94.0
2   2   NaN   7  15.0
3  22   NaN   1  53.0
4  77   NaN  88  91.0

In [14]:
df3 = DataFrame(data=np.random.randint(0,100,size= (5,2)),columns=['A','B'])
pd.concat((df1,df3),axis=0)

    A   B     C
0  19  38   0.0
1  46  80   1.0
2  30   9  24.0
3  38  11  87.0
4  67  94  36.0
0  45  76   NaN
1   0  14   NaN
2  79  72   NaN
3  92  41   NaN
4  70  98   NaN

### 合并merge
##### 一对一合并

In [15]:
dic1 ={
    'employee':['Bob','Jack','Lisa'],
    'group':['Accounting','Engineering','Engineering']
}
dic2 ={
    'employee':['Bob','Jack','Lisa'],
    'hire_date':[2004,2008,2012]
}
df1 = DataFrame(data=dic1)
df2 = DataFrame(data=dic2)

In [16]:
df1

  employee        group
0      Bob   Accounting
1     Jack  Engineering
2     Lisa  Engineering

In [17]:
df2

  employee  hire_date
0      Bob       2004
1     Jack       2008
2     Lisa       2012

In [18]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2004
1     Jack  Engineering       2008
2     Lisa  Engineering       2012

#### 一对多合并

In [20]:
df3 = DataFrame({
    'employee':['Jack','Lisa'],
    'group':['Engineering','Accounting'],
    'hire_date':[2004,2016]
})
df4 = DataFrame({
    'group':['Engineering','Engineering','Accounting'],
    'supervisor':['Carly','Gudio','Steve']
})

In [21]:
pd.merge(df3,df4)

  employee        group  hire_date supervisor
0     Jack  Engineering       2004      Carly
1     Jack  Engineering       2004      Gudio
2     Lisa   Accounting       2016      Steve